Импорт библиотек

In [2]:
import pandas as pd

**Считайте датасет из файла train.csv (это данные о выживаемости на Титанике)**

In [3]:
train_df = pd.read_csv('train.csv')
# Проверим, что данные корректно загрузились
train_df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

**Выведите основную информацию о датасете: информацию о типах данных, число пропусков, средние значения и т.д**

In [4]:
# Основная информация о типах данных
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [5]:
# Количество пропусков в каждом столбце
train_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

Можем наблюдать, что в столбцах age, cabin, embarked есть пропущенные значения, при этом, наибольшее количество пропущенных значений в толбце cabin

In [6]:
# описательная статистика
train_df.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

**Посчитайте процент выживаемости у каждого класса пассажиров (Pclass)**

In [7]:
# Чтобы посчитать процент выживаемости, нужно посчитать количество выживших пассажиров и разделить на общее количество пассажиров, для этого используем метод mean().\
#полученные данные группируем по классам пассажиров
survival_by_class = train_df.groupby('Pclass')['Survived'].mean() * 100
print(survival_by_class)

Pclass
1    62.962963
2    47.282609
3    24.236253
Name: Survived, dtype: float64

Наблюдаем сильную зависимость выживания от класса, чем выше класс - тем выше вероятность выжить

**Выведите самое популярное мужское и самое популярное женское имя на корабле**

In [ ]:
# Функция для нахождения имени
def extract_first_personal_name(full_name):
    parts = full_name.split(", ") # Избавляемся от места отбытия
    if len(parts) > 1:
        first_part = parts[1].split(".")[1]  # Удаление заголовка (Mr./Mrs.)
        personal_names = first_part.strip()  # Получаем имя и фамилию
        return personal_names
    return ""

In [9]:
# Создадим новый столбец FirstName, который будет содердать только имя пассажира
train_df["FirstName"] = train_df["Name"].apply(extract_first_personal_name)

# Популярные мужские и женские имена
male_names = train_df[train_df['Sex'] == 'male']['FirstName'].mode()
female_names = train_df[train_df['Sex'] == 'female']['FirstName'].mode()

print("Самое популярное мужское имя:", male_names[0])
print("Самое популярное женское имя:", female_names[0])

Самое популярное мужское имя: John
Самое популярное женское имя: Mary

**Выведите самое популярное мужское и самое популярное женское имя на корабле в каждом классе**

In [10]:
# Пробегаемся по кажому уникальному классу в датасете
for pclass in sorted(train_df['Pclass'].unique()):
    # Находим популярное мужское имя в классе
    males = train_df[(train_df['Pclass'] == pclass) & (train_df['Sex'] == 'male')]['FirstName'].mode()
    # Находим популярное женское имя в классе
    females = train_df[(train_df['Pclass'] == pclass) & (train_df['Sex'] == 'female')]['FirstName'].mode()
    # Выводи результат
    print(f"Класс {pclass}\n Мужское имя — {males[0]}\n Женское имя — {females[0]}")

Класс 1
 Мужское имя — Charles H
 Женское имя — (Edith Martha Bowerman)
Класс 2
 Мужское имя — William John
 Женское имя — Bertha
Класс 3
 Мужское имя — James
 Женское имя — Mary

**Выведите часть таблицы с пассажирами, возраст которых больше 44 лет**

In [11]:
# Копируем часть датасета
older_than_44 = train_df[train_df['Age'] > 44]
# Вывод результатов
older_than_44[['Name', 'Age', 'Pclass']]

                                                  Name   Age  Pclass
6                              McCarthy, Mr. Timothy J  54.0       1
11                            Bonnell, Miss. Elizabeth  58.0       1
15                    Hewlett, Mrs. (Mary D Kingcome)   55.0       2
33                               Wheadon, Mr. Edward H  66.0       2
52            Harper, Mrs. Henry Sleeper (Myna Haxtun)  49.0       1
..                                                 ...   ...     ...
857                             Daly, Mr. Peter Denis   51.0       1
862  Swift, Mrs. Frederick Joel (Margaret Welles Ba...  48.0       1
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)  47.0       1
873                        Vander Cruyssen, Mr. Victor  47.0       3
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)  56.0       1

[115 rows x 3 columns]

**Выведите часть таблицы с пассажирами, возраст которых меньше 44 лет и которые мужского пола**

In [12]:
# Копируем часть датасета
younger_than_44_male = train_df[(train_df['Age'] < 44) & (train_df['Sex'] == 'male')]
# Вывод результатов
younger_than_44_male[['Name', 'Age', 'Pclass']]

                               Name   Age  Pclass
0           Braund, Mr. Owen Harris  22.0       3
4          Allen, Mr. William Henry  35.0       3
7    Palsson, Master. Gosta Leonard   2.0       3
12   Saundercock, Mr. William Henry  20.0       3
13      Andersson, Mr. Anders Johan  39.0       3
..                              ...   ...     ...
883   Banfield, Mr. Frederick James  28.0       2
884          Sutehall, Mr. Henry Jr  25.0       3
886           Montvila, Rev. Juozas  27.0       2
889           Behr, Mr. Karl Howell  26.0       1
890             Dooley, Mr. Patrick  32.0       3

[368 rows x 3 columns]

**Выведите количества n-местных кабин (в которых было 2, 3, 4, ... человека)**

In [13]:
# Так как кабины имеют не только букву в наименовании, но и цифры, избавимся от цифр, для этого создадим новый столбец CabinDeck
train_df['CabinDeck'] = train_df['Cabin'].fillna('Unknown').str[0]

# Подсчет числа пассажиров в каютах
cabin_counts = train_df['CabinDeck'].value_counts()

# Вывод информации
cabin_counts

CabinDeck
U    687
C     59
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: count, dtype: int64

Количество кают, в которых больше 1 человека - 8